[
    {
        "imageSrc": "assets/announcement/3.png",
        "title": "Workshop on Nursing",
        "description": "Participate in our upcoming workshop focused on nursing skills and techniques. Connect with fellow nursing professionals and enhance your knowledge.",
        "postedBy": "Mary Smith"
    },
    {
        "imageSrc": "assets/announcement/1.png",
        "title": "Pharmacy Seminar",
        "description": "Join us for an insightful seminar on the latest trends and practices in pharmacy. Explore advancements in pharmaceutical science.",
        "postedBy": "Rebecca Green"
    },
    {
        "imageSrc": "assets/announcement/2.png",
        "title": "Doctor's Training Workshop",
        "description": "Improve your medical skills and knowledge in this comprehensive doctor's training workshop. Gain hands-on experience and expert guidance.",
        "postedBy": "John Doe"
    },
    {
        "imageSrc": "assets/announcement/5.png",
        "title": "Nutrition Seminar",
        "description": "Join us for a nutrition seminar and learn about healthy eating habits and nutritional science. Gain insights from leading nutritionists.",
        "postedBy": "Lara well"
    },
    {
        "imageSrc": "assets/announcement/4.png",
        "title": "Health Professional Workshop",
        "description": "A workshop dedicated to health professionals looking to expand their expertise. Enhance your skills and network with peers.",
        "postedBy": "Daniel Smith"
    },
    {
        "imageSrc": "assets/announcement/1.png",
        "title": "Nursing Techniques Seminar",
        "description": "Learn advanced nursing techniques in this interactive seminar. Enhance your practical skills and knowledge in a collaborative environment.",
        "postedBy": "Rebecca Green"
    },
    {
        "imageSrc": "assets/announcement/3.png",
        "title": "Pharmacist Training Program",
        "description": "Enhance your skills as a pharmacist with our specialized training program. Learn about new pharmaceutical practices and innovations.",
        "postedBy": "Mary Smith"
    },
    {
        "imageSrc": "assets/announcement/2.png",
        "title": "Health Awareness Workshop",
        "description": "Raise your health awareness by attending this informative workshop. Gain knowledge on preventive health measures and wellness.",
        "postedBy": "John Doe"
    },
    {
        "imageSrc": "assets/announcement/5.png",
        "title": "Doctor's Seminar",
        "description": "A seminar for doctors focusing on the latest medical research and practices. Stay updated with new findings and technologies.",
        "postedBy": "Lara well"
    },
    {
        "imageSrc": "assets/announcement/4.png",
        "title": "Nutritionist Workshop",
        "description": "Join our nutritionist workshop and gain insights into diet planning and nutrition. Learn from experts and improve your dietary knowledge.",
        "postedBy": "Daniel Smith"
    },
    {
        "imageSrc": "assets/announcement/3.png",
        "title": "Nursing Skills Enhancement",
        "description": "Enhance your nursing skills in this targeted workshop. Participate in practical sessions and improve your clinical competence.",
        "postedBy": "Mary Smith"
    },
    {
        "imageSrc": "assets/announcement/1.png",
        "title": "Pharmacy Practice Workshop",
        "description": "A workshop focused on modern pharmacy practices and innovations. Enhance your pharmaceutical knowledge and stay current in the field.",
        "postedBy": "Rebecca Green"
    },
    {
        "imageSrc": "assets/announcement/2.png",
        "title": "Health and Wellness Seminar",
        "description": "Participate in our health and wellness seminar to learn about holistic health practices. Improve your overall well-being with expert guidance.",
        "postedBy": "John Doe"
    },
    {
        "imageSrc": "assets/announcement/5.png",
        "title": "Doctor's Continuing Education",
        "description": "A continuing education workshop for doctors to stay updated on medical advancements. Enhance your knowledge and professional development.",
        "postedBy": "Lara well"
    },
    {
        "imageSrc": "assets/announcement/4.png",
        "title": "Nutrition and Health Workshop",
        "description": "Explore the connection between nutrition and health in this interactive workshop. Gain valuable insights and practical knowledge.",
        "postedBy": "Daniel Smith"
    },
    {
        "imageSrc": "assets/announcement/2.png",
        "title": "Nursing Leadership Seminar",
        "description": "Learn about leadership in nursing and how to take charge in healthcare settings. Enhance your leadership skills and confidence.",
        "postedBy": "John Doe"
    },
    {
        "imageSrc": "assets/announcement/1.png",
        "title": "Pharmacist Innovation Workshop",
        "description": "Discover new innovations in the field of pharmacy in this workshop. Stay updated with the latest advancements and trends.",
        "postedBy": "Rebecca Green"
    }
]
